Repository: 84000/data-translation-memory
Catalog: toh269-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཕྱོགས་བཅུའི་མུན་པ་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra Dispelling the Darkness of the Ten Directions

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་རྣམས་ཀྱི་ནང་ན། སེར་སྐྱའི་གནས་ཤིང་ནྱ་གྲོ་དྷའི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱམས་པ་དང་། འཇམ་དཔལ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ།
en: The Blessed One was dwelling among the Śākyas at Nyagrodha Park in Kapilavastu, together with a great assembly of 1,250 monks and a great retinue of bodhisattvas including Maitreya and Mañjuśrī.

source: ཤམ་ཐབས་གསོལ་ནས། ལྷུང་བཟེད་དང་། ཆོས་གོས་བསྣམས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ལ་གཤེགས་སོ། །
en: In the morning the Blessed One put on his lower robe and, taking up his alms bowl and upper dharma robe, surrounded and escorted by an assembly of monks, traveled to the great city of Kapilavastu to receive alms.

source: དེའི་ཚེ་ན་ཤཱཀྱ་གཞོན་ནུ་བཞིན་རབ་གསལ་ཞེས་བྱ་བ་ཞིག་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་ཤིང་རྟ་ལ་ཞོན་ནས་སེར་སྐྱའི་གནས་གྲོང་ཁྱེར་ཆེན་པོ་ནས་ཕྱིར་བྱུང་བ་དང་།
en: At that time, a Śākya youth known as Shining Countenance was setting out from the great city of Kapilavastu in a chariot to attend to some affairs.

source: ཤཱཀྱ་གཞོན་ནུ་བཞིན་རབ་གསལ་གྱིས། བཅོམ་ལྡན་འདས་ཐག་རིང་པོ་ཁོ་ན་ནས་གཤེགས་པ་མཐོང་ངོ་། །
en: Even from a great distance, the Śākya youth Shining Countenance saw the Blessed One approach.

source: མཐོང་ནས་ཀྱང་ཤིང་རྟ་དེ་ལས་བབས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: Seeing him, he dismounted from the chariot and went to where the Blessed One was, bowed with palms joined in the direction of the Blessed One, and bowed his head to the Blessed One’s feet.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: He then circumambulated the Blessed One three times, and with palms joined sat before the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཤཱཀྱ་གཞོན་ནུ་བཞིན་རབ་གསལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ན་བདག་གི་ཕ་མ་གཉིས་གཉིད་ལོག་པ་དང་མ་ལོག་པ་དག་ལ་མི་མ་ལགས་པ་རྣམས་རྣམ་པར་འཚེ་བར་བགྱིད་ལ།
en: The Śākya youth Shining Countenance then made this request of the Blessed One: “Blessed One, here in this city both my father and mother, while they are asleep or awake, might be harmed by nonhuman beings.

source: བཅོམ་ལྡན་འདས་བདག་ཀྱང་གང་གི་ཚེ་ལྗོངས་ཀྱི་ཕྱོགས་གཞན་དུ་མཆི་བའི་ཚེ། བདག་ལ་ཡང་ཆོམ་རྐུན་པ་དག་རྣམ་པར་འཚེ་བར་བགྱིད་ཅིང་། གཅན་གཟན་དག་ཀྱང་རྣམ་པར་འཚེ་བར་བགྱིད་ན།
en: Blessed One, I, too, when traveling to other lands, might be harmed by bandits or wild animals.

source: དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་ཅི་ནས་ཀྱང་བདག་ལ་མིའམ། མི་མ་ལགས་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་སུ་གཏོགས་པ་འགའ་ཡང་རྣམ་པར་འཚེ་བར་མི་བགྱིད་པ་དེ་ལྟར་བདག་ལ་ལེགས་པར་བསྲུང་བ་མཛད་དུ་གསོལ།
en: Therefore, may the blessed, thus-gone, worthy, completely perfect Buddha, out of compassion for me and by any means, protect me so that human and nonhuman beings and those in the animal realm do not harm me.

source: བསྲུང་བའི་ཆོ་ག་ཡང་བཤད་དུ་གསོལ། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Please teach a rite of protection.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཤཱཀྱ་གཞོན་ནུ་བཞིན་རབ་གསལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to the Śākya youth Shining Countenance, “Young man, listen carefully then and keep this in mind.

source: གཞོན་ནུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: I will instruct you.”

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་ནས། ཤཱཀྱ་གཞོན་ནུ་བཞིན་རབ་གསལ་བཅོམ་ལྡན་འདས་ལ་ཉན་པ་དང་།
en: “Blessed One, please do so,” requested the Śākya youth Shining Countenance, and he listened to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གཞོན་ནུ་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱད་ཁྲི་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཉོན་མོངས་པ་ཐམས་ཅད་བསྐྱོད་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: The Blessed One said, “Young man, in the eastern direction, eighty thousand buddha fields beyond this buddha field, there is a world system known as Shaking All Defilements.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྗེས་སྤྱོད་ཅེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: There the thus-gone, worthy, completely perfect buddha known as Follower presently resides, alive and well.

source: གཞོན་ནུ་ཁྱོད་གང་གི་ཚེ་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་ཤར་ཕྱོགས་སུ་འགྲོ་ན། དེའི་ཚེ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཕྱག་འཚལ་ཏེ་དྲན་པར་བྱས་ཤིང་མདུན་དུ་བྱས་ཏེ།
en: Young man, when you set out in the eastern direction to attend to some affairs, pay homage to that thus-gone one, remembering and honoring him.

source: སེམས་ཀྱི་རྒྱུན་གྱིས་དེ་མངོན་དུ་བྱེད་ཅིང་སོང་ན་ཁྱོད་ལ་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: If you bring this clearly to mind and then depart, you will have no fear.

source: དེའི་ཚེ་མ་གཡེངས་པར་དེ་ཡིད་ལ་བྱས་ན་ཁྱོད་བྱ་བ་གང་གི་ཕྱིར་འགྲོ་བའི་བྱ་བ་དེ་འགྲུབ་པར་འགྱུར་རོ། །
en: If you hold this in your mind without distraction during that time, you will accomplish the purpose for which you embarked.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་བཀའ་སྩལ་ཏོ། །
en: Then, at that time, the Blessed One spoke the following verse:

source: རྫོགས་པའི་སངས་རྒྱས་ཐུབ་པ་ཆེ། །རྗེ་ལ་རབ་ཏུ་ཕྱག་འཚལ་ཏེ། །
en: “Thoroughly honoring the lord, The completely perfect Buddha, the great sage,

source: རྟག་ཏུ་དེ་ནི་མངོན་བྱེད་ཅིང་། །
en: If you maintain this clearly and then depart,

source: འགྲོ་ན་ཁྱོད་ལ་འཇིགས་མི་འབྱུང་། །
en: You will have no fear.

source: གཞོན་ནུ་ལྷོ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དགུ་ཁྲི་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མུན་པ་དང་མུན་ནག་གི་ཚོགས་བཅོམ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, in the southern direction, ninety thousand buddha fields beyond this buddha field, there is a world system known as Dispelling the Mass of Dense Darkness.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེམས་དང་པོ་བསྐྱེད་པ་ཡིད་ལ་མཛད་པ་རྣམ་གྲངས་བསྙེངས་པ་དང་བག་ཚ་བ་དང་བྲལ་བས་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: There, the thus-gone, worthy, completely perfect buddha known as King Who Is Superior Due to Freedom from Fear and Timidity in Any Activity Since First Generating the Mind of Awakening presently resides, alive and well.

source: གཞོན་ནུ་ཁྱོད་གང་གི་ཚེ་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་ལྷོ་ཕྱོགས་སུ་འགྲོ་ན། དེའི་ཚེ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཕྱག་འཚལ་ཏེ་དྲན་པར་བྱས་ཤིང་མདུན་དུ་བྱས་ཏེ།
en: Young man, when you set out in the southern direction to attend to some affairs, at that time, pay homage to that thus-gone one, remembering and honoring him.

source: སེམས་ཀྱི་རྒྱུན་གྱིས་དེ་མངོན་དུ་བྱེད་ཅིང་། ཁྱིམ་ལ་སོགས་པའི་ཡིད་ལ་བྱེད་པ་དང་བྲལ་བ་རྣམ་པར་མ་གཡེངས་པ་ཡིད་ལ་བྱེད་པས་སོང་ན། ཁྱོད་བྱ་བ་གང་གི་ཕྱིར་འགྲོ་བའི་བྱ་བ་དེ་འགྲུབ་པར་འགྱུར་ཞིང་། ཁྱོད་ལ་འཇིགས་པ་གང་ནས་ཀྱང་འབྱུང་བར་མི་འགྱུར་རོ། །
en: If you bring this clearly to mind and then depart while remaining undistracted, free of thoughts of home and so forth, you will accomplish the purpose for which you embarked, and you will not fear anything.”

source: ཁྱིམ་གྱི་བསམ་པ་རྣམས་དང་ནི། །ཀུན་ནས་ལྡང་བ་ཀུན་བྲལ་ཞིང་། །
en: “Freed from obsession With thoughts of home,

source: ལྷོ་ཕྱོགས་སུ་ནི་འགྲོ་བ་ན། །
en: When you travel south

source: ཁྱོད་ལ་འཇིགས་པ་འབྱུང་མི་འགྱུར། །
en: You will experience no fear.

source: གཞོན་ནུ་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡུལ་ཕེབས་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, in the western direction, as many buddha fields beyond this buddha field as there are grains of sand in the Ganges River, there is a world system known as Reaching One’s Goal.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཁོན་དང་རྒྱགས་པ་རྣམ་པར་གནོན་པ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: There, the thus-gone, worthy, completely perfect buddha known as Subjugator of Resentment and Conceit presently resides, alive and well.

source: གཞོན་ནུ་ཁྱོད་གང་གི་ཚེ་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་ནུབ་ཕྱོགས་སུ་འགྲོ་ན་དེའི་ཚེ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཕྱག་འཚལ་ཏེ། དྲན་པར་བྱས་ཤིང་མདུན་དུ་བྱས་ནས་སེམས་ཀྱི་རྒྱུན་གྱིས་དེ་མངོན་དུ་བྱེད་ཅིང་ཟག་པ་མེད་པ་དང་།
en: Young man, when you set out in the western direction to attend to some affairs, at that time, pay homage to that thus-gone one, remembering and honoring him.

source: རྣམ་པར་མ་གཡེངས་པ་དང་དྲན་པས་སོང་ན་ཁྱོད་ལ་འཇིགས་པ་གང་ནས་ཀྱང་འབྱུང་བར་མི་འགྱུར་རོ། །
en: If you bring this clearly to mind and then depart without defilements, undistracted, and with mindfulness, you will not fear anything.”

source: ཆོས་འགའ་སྐྱེས་པ་ཡོད་མིན་ཞིང་། །
en: “There are no phenomena that arise,

source: འགའ་ཡང་འགག་པར་མི་འགྱུར་ཏེ། །
en: Nor are there any that cease.

source: གང་གིས་ཆོས་རྣམས་དེ་ལྟར་ཤེས། །
en: Those who understand phenomena thus

source: དེ་ལ་འཇིགས་པ་ཅི་ཡང་མེད། །
en: Have no fear whatsoever.

source: གཞོན་ནུ་བྱང་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་སྟོང་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་སྤོབས་པ་ཅན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, in the northern direction, ten billion buddha fields beyond this buddha field, there is a world system known as Possessing a Buddha’s Eloquence.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཟུགས་བཀོད་འོད་གནོན་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: There, the thus-gone, worthy, completely perfect buddha known as Overpowering with the Light of an Array of the Reflections of Jewels presently resides, alive and well.

source: གཞོན་ནུ་ཁྱོད་གང་གི་ཚེ་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་བྱང་ཕྱོགས་སུ་འགྲོ་ན། དེའི་ཚེ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཕྱག་འཚལ་ཏེ་དྲན་པར་བྱས་ཤིང་མདུན་དུ་བྱས་ཏེ།
en: Young man, when you set out in the northern direction to attend to some affairs, at that time, pay homage to that thus-gone one, remembering and honoring him.

source: སེམས་ཀྱི་རྒྱུན་གྱིས་དེ་མངོན་དུ་བྱེད་ཅིང་རྣམ་པར་མ་གཡེངས་པར་ཡིད་ལ་བྱེད་པས་སོང་ན། ཁྱོད་བྱ་བ་གང་གི་ཕྱིར་འགྲོ་བའི་བྱ་བ་དེ་འགྲུབ་པར་འགྱུར་ཞིང་ཁྱོད་ལ་འཇིགས་པ་གང་ནས་ཀྱང་འབྱུང་བར་མི་འགྱུར་རོ། །
en: If you bring this clearly to mind and then depart while remaining undistracted, you will accomplish the purpose for which you embarked, and you will not fear anything.”

source: རྟག་ཏུ་སེམས་ཅན་ཐམས་ཅད་ལ། །མཉམ་པ་ཉིད་ཀྱི་སེམས་བྱོས་ལ། །
en: “Always make the mind equal Toward all sentient beings.

source: སེམས་ཅན་དེ་ལ་མ་བརྙས་དང་། །
en: If you do not disrespect any sentient being,

source: ཁྱོད་ལ་འཇིགས་པར་འབྱུང་མི་འགྱུར། །
en: You will experience no fear.

source: གཞོན་ནུ་བྱང་ཤར་གྱི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱད་ཁྲི་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་བདུད་ཀྱི་སྡེ་བཅོམ་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, in the northeastern direction, eighty thousand buddha fields beyond this buddha field, there is a world system known as Conquered the Legions of Māra.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུད་དང་ཡིད་གཉིས་ཀུན་འཇོམས་རྣམ་གནོན་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: There, the thus-gone, worthy, completely perfect buddha known as Māras and Doubt Conquered and Subdued presently resides, alive and well.

source: དེ་བཞིན་གཤེགས་པ་དེ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་བཞུགས་པ་ཙམ་གྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་མཛད་དེ།
en: That thus-gone one, by merely sitting under the Bodhi tree, made it so all the gods of the māra class that exist in that trichiliocosm would not regress from unsurpassed, completely perfect awakening.

source: གཞོན་ནུ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དེ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་བཞུགས་པའི་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་བྱུང་བ་ཡིན་ནོ། །
en: Young man, such was the heroic effort of that thus-gone one in sitting beneath the Bodhi tree.

source: གཞོན་ནུ་ཁྱོད་གང་གི་ཚེ་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་བྱང་ཤར་གྱི་ཕྱོགས་སུ་འགྲོ་ན་དེའི་ཚེ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ། ཕྱག་འཚལ་ཏེ་དྲན་པར་བྱས་ཤིང་མདུན་དུ་བྱས་ཏེ།
en: Young man, when you set out in the northeastern direction to attend to some affairs, at that time, pay homage to that thus-gone one, remembering and honoring him.

source: སེམས་ཀྱི་རྒྱུན་གྱིས་དེ་མངོན་དུ་བྱེད་ཅིང་རྣམ་པར་མ་གཡེངས་པས་སོང་ན་ཁྱོད་བྱ་བ་གང་གི་ཕྱིར་འགྲོ་བའི་བྱ་བ་དེ་འགྲུབ་པར་འགྱུར་ཞིང་ཁྱོད་ལ་འཇིགས་པ་གང་ནས་ཀྱང་འབྱུང་བར་མི་འགྱུར་རོ། །
en: If you bring this clearly to mind and then depart without distraction, you will accomplish the purpose for which you embarked, and you will not fear anything.”

source: གང་གིས་དང་པོའི་ཐུགས་ཀྱིས་ནི། །
en: “If you travel while keeping in mind

source: བདུད་རྣམས་ཕམ་མཛད་སངས་རྒྱས་དེ། །
en: The Buddha who defeated the māras

source: དྲན་བཞིན་དུ་ནི་ཁྱོད་སོང་ན། །
en: With his very first thought,

source: གཞོན་ནུ་ཤར་ལྷོའི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཉི་ཁྲི་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རྟག་ཏུ་སྣང་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, in the southeastern direction, twenty thousand buddha fields beyond this buddha field, there is a world system known as Ever Radiant.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེམས་དང་པོ་བསྐྱེད་པས་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་འབྱུང་བའི་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: There, the thus-gone, worthy, completely perfect buddha known as Glory of the Arising of the Irreversible Wheel Since First Generating the Mind of Awakening presently resides, alive and well.

source: གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་དེས་དང་པོ་ཐུགས་བསྐྱེད་པ་ནས་བཟུང་སྟེ། སངས་རྒྱས་པ་ཉིད་ཀྱི་བར་དུ་བར་ཆད་མེད་པར་སྦྱིན་པ་བྱིན། ཚུལ་ཁྲིམས་བསྲུངས། བཟོད་པ་ཀུན་ཏུ་བསྟེན། བརྩོན་འགྲུས་བརྩམས།
en: Young man, that thus-gone one, from the moment of generating the first thought of awakening until attaining buddhahood, continually performed acts of generosity, guarded his moral discipline, assiduously practiced patience, exerted himself in diligence, established concentration, and practiced wisdom.

source: བསམ་གཏན་བསྒྲུབས། ཤེས་རབ་སྤྱད་དེ། གཞོན་ནུ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དེའི་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་བྱུང་བ་ཡིན་ནོ། །
en: Young man, such was the heroic effort of that thus-gone one.

source: གཞོན་ནུ་ཁྱོད་གང་གི་ཚེ་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་ཤར་ལྷོའི་ཕྱོགས་སུ་འགྲོ་ན། དེའི་ཚེ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་ཏེ། ཕྱིས་ཁྱིམ་ནས་སོང་ཤིག་དང་།
en: Young man, when you set out in the southeastern direction to attend to some affairs, prostrate with your five limbs and then depart from your home.

source: ཁྱོད་ལ་ཕྱིས་འགྱོད་པའམ་འཇིགས་པ་གང་ནས་ཀྱང་འབྱུང་བར་མི་འགྱུར་རོ། །
en: Later you will not experience any regret and will not fear anything.

source: རྣམ་པར་མ་གཡེངས་པས་ཡིད་ལ་བྱེད་ན། ཁྱོད་བྱ་བ་གང་གི་ཕྱིར་འགྲོ་བའི་བྱ་བ་དེ་འགྲུབ་པར་འགྱུར་རོ། །
en: If you remain undistracted, you will accomplish the purpose for which you embarked.”

source: ཡན་ལག་ལྔས་ནི་ཕྱག་འཚལ་ཏེ། །
en: “Prostrate with the five limbs,

source: ཕྱི་ནས་ཁྱིམ་ནས་སོང་ཤིག་དང་། །
en: Then depart from home.

source: ཆོམ་རྐུན་རྣམས་ཀྱིས་ཁྱོད་ཀུན་ཏུ། །
en: You will travel

source: ཟིལ་གྱིས་མི་ནོན་འགྲོ་བར་འགྱུར། །
en: Without being overpowered by bandits.

source: གཞོན་ནུ་ལྷོ་ནུབ་ཀྱི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སུམ་ཁྲི་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་གསེར་གྱི་དྲ་བས་གཡོགས་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, in the southwestern direction, thirty thousand buddha fields beyond this buddha field, there is a world system known as Covered by a Golden Net.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གདུགས་འཕགས་སྣང་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: There, the thus-gone, worthy, completely perfect buddha known as Superior Illumination of a Jeweled Canopy presently resides, alive and well.

source: གཞོན་ནུ་ཁྱོད་གང་གི་ཚེ་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་ལྷོ་ནུབ་ཀྱི་ཕྱོགས་སུ་འགྲོ་ན་དེའི་ཚེ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཕྱག་འཚལ་ཏེ་དྲན་པར་བྱས་ཤིང་མདུན་དུ་བྱས་ཏེ།
en: Young man, when you set out in the southwestern direction to attend to some affairs, at that time, pay homage to that thus-gone one, remembering and honoring him.

source: སེམས་ཀྱི་རྒྱུན་གྱིས་དེ་མངོན་དུ་བྱེད་ཅིང་རྣམ་པར་མ་གཡེངས་པའི་ཡིད་ལ་བྱེད་པས་སོང་ན་ཁྱོད་ལ་འཇིགས་པ་གང་ནས་ཀྱང་འབྱུང་བར་མི་འགྱུར་ཞིང་ཁྱོད་བྱ་བ་གང་གི་ཕྱིར་འགྲོ་བའི་བྱ་བ་དེ་འགྲུབ་པར་འགྱུར་རོ། །
en: If you bring this clearly to mind and then depart while remaining undistracted, you will not fear anything, and you will accomplish the purpose for which you embarked.”

source: རྫོགས་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ནས། །
en: “Having paid homage to the perfect Buddha,

source: མེ་ཏོག་སིལ་མས་གཏོར་ཅིག་དང་། །
en: Strew some flower petals.

source: ཁྱོད་ནི་ལྷོ་ནུབ་འགྲོ་བ་ན། །
en: When you travel to the southwest,

source: འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: You will not experience fear.

source: གཞོན་ནུ་ནུབ་བྱང་གི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དྲུག་གི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་དག་རབ་གནས་མངོན་པར་འཕགས་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, in the northwestern direction, as many buddha fields beyond this buddha field as there are grains of sand in six Ganges Rivers, there is a world system known as Purified, Steadfast, and Exalted.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་འདུལ་བ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: There, the thus-gone, worthy, completely perfect buddha known as Tamer of Bodhisattvas presently resides, alive and well.

source: གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་མི་གཙང་བ་མེད་པ། འཁྲིག་པ་མེད་པ། བུད་མེད་མེད་པ། ཚེར་མ་དང་།
en: Young man, that thus-gone one’s buddha field is without impurity, without sexual intercourse, without women, without thorns, pebbles, and gravel, and without the five degenerations.

source: གསེག་མ་དང་། གྱོ་མོ་མེད་པ། སྙིགས་མ་ལྔ་མེད་པ་ཡིན་ནོ། །གཞོན་ནུ་ཁྱོད་གང་གི་ཚེ་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་ནུབ་བྱང་གི་ཕྱོགས་སུ་འགྲོ་ན་ཚངས་པར་སྤྱོད་པ་ཡང་དག་པར་བླངས་ནས་ཕྱིས་ཁྱིམ་ནས་རྣམ་པར་མ་གཡེངས་པའི་ཡིད་ལ་བྱེད་པས་སོང་ཤིག་དང་།
en: Young man, when you set out in the northwestern direction to attend to some affairs, having first correctly observed pure conduct, depart from home with an undistracted mind.

source: གཞོན་ནུ་ཁྱོད་བྱ་བ་གང་གི་ཕྱིར་འགྲོ་བའི་བྱ་བ་དེ་འགྲུབ་པར་འགྱུར་ཞིང་ཁྱོད་ལ་འཇིགས་པ་གང་ནས་ཀྱང་འབྱུང་བར་མི་འགྱུར་རོ། །
en: Young man, you will accomplish the purpose for which you embarked, and you will not fear anything.”

source: ཚངས་སྤྱོད་ཡང་དག་བླངས་བྱས་ཏེ། །
en: “Having first correctly observed pure conduct,

source: ཁྱོད་ནི་གང་དང་གར་འགྲོ་ཡང་། །
en: Wherever you travel,

source: ཆོམ་རྐུན་རྣམས་ཀྱིས་ཟིལ་མི་ནོན། །
en: You will not be overpowered by bandits.

source: གཞོན་ནུ་སྟེང་གི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དྲུག་ཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་དམིགས་པ་མེད་པ་ཡིད་ལ་བྱེད་པ་ཅན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, in the direction of the zenith, as many buddha fields beyond this buddha field as there are grains of sand in sixty Ganges Rivers, there is a world system known as Possessing Nonreferential Application of Mind.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐྲག་མེད་མུན་བྲལ་ཏིང་ངེ་འཛིན་མངོན་འཕགས་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །
en: There, the thus-gone, worthy, completely perfect buddha known as Exalted King of Meditative Concentration Fearless and Free from Darkness presently resides, alive and well.

source: གཞོན་ནུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཕྱག་འཚལ་ཏེ་དྲན་པར་བྱས་ཤིང་མདུན་དུ་བྱས་ཏེ་འདུག་ཀྱང་རུང་།
en: Young man, pay homage to that thus-gone one, remembering and honoring him.

source: འགྲེང་ཡང་རུང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པས་ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཤིང་གནས་ན་ཁྱོད་ལ་འཇིགས་པ་གང་ནས་ཀྱང་འབྱུང་བར་མི་འགྱུར་རོ། །
en: If, whether sitting or standing, you pervade all beings with loving kindness and then perfect and maintain it, you will not fear anything.”

source: ཁྱོད་ཀྱིས་མ་གཡེངས་ཡིད་བྱེད་ཀྱིས། །
en: “Keeping the mind undistracted,

source: རྟག་ཏུ་རྒྱལ་བ་དེ་དྲན་ཞིང་། །
en: Always remember that victorious one;

source: རྟག་ཏུ་བྱམས་པའི་སེམས་བྱོས་དང་། །
en: Always develop the mind of loving kindness,

source: གཞོན་ནུ་འོག་གི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དགུ་ཁྲི་ཉིས་སྟོང་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, in the direction of the nadir, ninety-two thousand buddha fields beyond this buddha field, there is a world system known as Adorned with All Qualities.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དང་པོ་སེམས་བསྐྱེད་ཐེ་ཙོམ་གཅོད་མཛད་ཉོན་མོངས་བསྐྱོད་ཅེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ། །གཞོན་ནུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་བྱ་བ་རྩོམ་པ་ཐམས་ཅད་དང་། འགྲེང་ཡང་རུང་།
en: There, the thus-gone, worthy, completely perfect buddha known as Cutting Doubt and Shaking the Defilements Since First Generating the Mind of Awakening presently resides, alive and well.

source: འདུག་ཀྱང་རུང་། འཆག་ཀྱང་རུང་སྟེ། སྤྱོད་ལམ་ཐམས་ཅད་དུ་ཕྱག་འཚོལ་ཅིག །ཡིད་ལ་བྱོས་ཤིག་དང་། སེམས་ཅན་རྣམས་ལ་བྱམས་པའི་སེམས་དང་།
en: Young man, at the commencement of all actions and during all activities, whether you are standing, sitting, or moving about, pay homage to that thus-gone one, keep him in mind, and establish the mind of loving kindness for beings and the beneficent mind.

source: ཕན་པའི་སེམས་སྒྲུབས་ཤིག་དང་། གཞོན་ནུ་ཁྱོད་ལ་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་ཞིང་། དགོས་པ་ཐམས་ཅད་ཀྱང་འབད་མི་དགོས་པར་འགྲུབ་པར་འགྱུར་རོ། །
en: Young man, you will not experience fear, and all your needs will be effortlessly accomplished.”

source: བྱ་བ་ཀུན་ལ་ཉིན་མཚན་དུ། །
en: “In every activity, day and night,

source: སངས་རྒྱས་དེ་ནི་དྲན་བྱ་ཞིང་། །
en: Remember that buddha

source: བྱང་ཆུབ་སེམས་ཀྱང་མ་གཏང་དང་། །
en: And do not relinquish the mind of awakening,

source: གཞོན་ནུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་མཚན་ལེགས་པར་བཟུང་བར་གྱིས་ཤིག །ལེགས་པར་བཅང་བར་གྱིས་ཤིག །
en: “Young man, apprehend well the names of those thus-gone, worthy, completely perfect buddhas.

source: ལེགས་པར་ཀུན་ཆུབ་པར་གྱིས་ཤིག་དང་། འཇིགས་པའམ། བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་གང་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ཁྱོད་ལ་འབྱུང་བར་མི་འགྱུར་རོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Keep them well and comprehend them well, and you will not experience any of those fears, anxieties, and terrors.” Thus spoke the Blessed One to the youth.

source: བཅོམ་ལྡན་འདས་ལ་ཤཱཀྱ་གཞོན་ནུ་བཞིན་རབ་གསལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་མཚན་རྣམས་བཟུང་ལགས་ཏེ།
en: The Śākya youth Shining Countenance then said to the Blessed One, “Blessed One, I will apprehend the names of those thus-gone, worthy, completely perfect buddhas.

source: བཅོམ་ལྡན་འདས་བདག་ལ་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་མུན་པ་མ་མཆིས་ཤིང་།
en: For me, Blessed One, there is no darkness whatsoever in those world systems.

source: བཅོམ་ལྡན་འདས་བདག་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ཀྱང་དཔེར་ན་དེ་བཞིན་གཤེགས་པ་ད་ལྟར་འཁོར་རྣམས་ལ་ཆོས་སྟོན་པ་བཞིན་དུ་མཐོང་ངོ་། །
en: Blessed One, I see those world systems and those thus-gone, worthy, completely perfect buddhas, just as I now see the Thus-Gone One teaching the Dharma to the assemblies.”

source: དེ་ནས་འཁོར་དེ་ལས་ཤཱཀྱ་གཞོན་ནུ་བཞིན་རབ་གསལ་ལ་སོགས་པ་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་ཚོགས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་འཚལ་བ་དང་། མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བ་དང་།
en: Then, from among that gathering, the Śākya youth Shining Countenance and the others, the great host of beings, looked upon the Blessed One, paid homage, made offerings, and attended upon him.
